[
  {
    "slug": "learners-what",
    "q": "What is Catamyst?",
    "a": "<p>Catamyst is an all-in-one platform to learn and practice web development, UI/UX design, and software engineering skills. Beyond learning, we also help you in career development aiming for professional work in the current tech industry. We want to help learners like you accelerate your progress to be a high quality web developer, UI/UX designer, or software engineer.</p>"
  },
  {
    "slug": "learners-know-code",
    "q": "Do I have to know how to code before joining Catamyst?",
    "a": "<p>No, you don't have to. You are open to join regardless your background and experience. You just need to have willingness to learn and giving the best effort you can make.</p>"
  },
  {
    "slug": "learners-free-paid",
    "q": "Is Catamyst free or paid?",
    "a": "<p>Both. You can start learning for free. But if you need to get more levels beyond the free one, you can subscribe for the paid <alink href='/pricing'>Pro plan</alink>. Or if you need direct, live, private 1-on-1 mentorship with experienced developers, you can request for a <alink href='/pricing'>Super plan</alink>.</p>"
  },
  {
    "slug": "learners-different-bootcamp",
    "q": "How is Catamyst different than coding bootcamp?",
    "a": "<p>Learning in Catamyst doesn't have any time limit and ties to a specific location, so you learn at your own pace or schedule. The provided lessons are also categorized based on what levels you're interested right now. Our pricing is also far more affordable too. But still, if you need a direct support real experienced professional, we also provide mentorship with our <alink href='/pricing'>Super plan</alink>.</p>"
  },
  {
    "slug": "learners-different-platform",
    "q": "How is Catamyst different than other learning platform?",
    "a": "<p>We strive to give you the complete, comprehensive, and guided learning experience started from the absolute beginning. You can choose to learn and practice different levels such as Newbie, Beginner, Intermediate, Advanced, and Expert. Our learning materials are composed into different Tracks, Topics, and Lessons. The formats are using texts, images, videos, audio, code examples, and some extra real-world references from other professionals.</p><p>Therefore you are able to build high-quality website or application as a solid portfolio that can be unique, relevant, live, and used by people. Finally, you might get a high-paying job or even building a software business around it.</p>"
  },
  {
    "slug": "learners-guarantee-job",
    "q": "Do you guarantee a job placement?",
    "a": "<p>Catamyst would like to maximize your skill to be prepared as a job-ready professional as much as possible. But obviously in the end it's still your effort that make you get the real job. So, we don't guarantee, but with us you increase the chance a lot more.</p>"
  },
  {
    "slug": "learners-topics",
    "q": "What topics can I learn with Catamyst?",
    "a": "<p>There are a lot of lessons. Right now mostly around web development and software engineering: some introductions, professional skills and principles, operating system, design tools, documentation (with Markdown), code editor (with VS Code), terminal, version control system (Git and GitHub), HTML, CSS, responsive web design, deployment (with Netlify and Vercel), JavaScript, TypeScript, browser APIs, Node.js, software design adn architecture, REST API, GraphQL API (with Apollo), SSH, Object-Oriented Programming (OOP), Functional Programming (FP), React, state management (with Redux), database (SQL with PostgreSQL, NoSQL with MongoDB), ORM (with Prisma), web server (with PM2 and Nginx), containerization (with Docker), other ways of deployment (with Heroku, Railway, VPS, Google Cloud Platform, Amazon Web Services), testing (with Jest and testing-library), continuous integration/deployment or CI/CD (with GitHub actions, Circle CI), and much more.</p><p>For more details, <alink href='/learn/web-app'>visit the Web Application Development track</alink>.</p>"
  },
  {
    "slug": "learners-allinone",
    "q": "Why need an all-in-one platform? Why not connecting Teachable, Udacity, Udemy, LinkedIn, Twitter, Facebook, GitHub, Dribbble, Codementor, Indeed, Discord, Stack Overflow, etc",
    "a": "<p>That's the thing. It's actually hard to juggle with too many different tools and places at once just to do everything from learning, showcasing, discussing, asking, answering, writing, publishing, mentoring, applying and posting job vacancy. That's why Catamyst take the chance to make all of these seamless within one platform.</p>"
  }
]
