[
  {
    "id": 1,
    "title": "Web development introduction",
    "slug": "web-development-introduction",
    "level": "newbie",
    "type": "fundamental",
    "blocks": [
      {
        "component": "image",
        "name": "Cat sitting in front of artworks",
        "src": "https://res.cloudinary.com/catamyst/image/upload/v1614086320/cat-with-artworks.png",
        "width": "300px",
        "height": "250px",
        "sourceUrl": "https://catamyst.com"
      },
      {
        "component": "texts",
        "html": "<p>Meet Neko. Neko is a painter from Japan. Neko has been painting for 10 years. Since Neko has many paintings at his home, Neko wants to share his artworks with many people around the world, beyond just Japan.</p><p>What do you think is the best way for Neko to share them?</p><p>A. Travel to all countries in the world and bring all of the artworks directly.</p><p>B. Publish the artworks on a website.</p><p>Of course, if Neko wants to share the artworks with people around the world, it will be faster and cheaper if they are published on a website. A website makes it possible for Neko to reach many people without visiting all countries by himself.</p><p>But to learn how to build the website, Neko needs to learn about web development. After Neko learn and practice the basics of web development, now Neko can publish the artworks on a website.</p><p>Below is an example of nice-looking website, called Google Arts &amp; Culture:</p>"
      },
      {
        "component": "image",
        "type": "screenshot",
        "name": "Google Arts & Culture website - Cats in culture",
        "src": "https://res.cloudinary.com/catamyst/image/upload/v1614086326/google-arts-culture.jpg",
        "width": "1440px",
        "height": "900px",
        "sourceUrl": "https://artsandculture.google.com"
      },
      {
        "component": "texts",
        "html": "<h1>What is web development?</h1><p>Web development is the process of building websites that run in a web browser. Web development powers popular sites like Google, Wikipedia, Twitter, YouTube, Facebook, Instagram, LinkedIn, Airbnb, and more. Even systems on software from Apple and Microsoft. And obviously, your favorite websites included!</p><p>In this learning track, you will obtain fundamental concepts and specific tools to build high-quality websites and web applications. Ultimately, you will be able to master your strengths in problem-solving and showcasing a portfolio that could leverage you to land a decent job or a freelance offer. You can even build your own tech business using the knowledge and skillset you obtain here.</p><h1>Who is a web developer?</h1><p>A web developer is the one who builds and maintains websites or web applications. They are also sometimes responsible to design how you would see and experience a website. Although, the work for the design can also be given to the dedicated web designers instead.</p><h1>Who can learn web development?</h1><p>Even though Neko is a painter, Neko can learn web development and build a website. So, no matter what your education and career background are, you can learn to build your own websites and web applications as long as you make the effort.</p>"
      },
      {
        "component": "references",
        "items": [
          {
            "title": "Web development",
            "source": "Wikipedia",
            "type": "article",
            "url": "https://en.wikipedia.org/wiki/Web_development"
          }
        ]
      }
    ]
  },
  {
    "id": 2,
    "title": "Activities overview",
    "slug": "activities-overview",
    "level": "newbie",
    "type": "fundamental",
    "blocks": [
      {
        "component": "image",
        "name": "Cat reading a book",
        "src": "https://res.cloudinary.com/catamyst/image/upload/v1614160954/cat-reading-book.png",
        "width": "250px",
        "height": "237px",
        "sourceUrl": "https://catamyst.com"
      },
      {
        "component": "texts",
        "html": "<h1>Learn the fundamentals and specific tools</h1><p>You have to learn the fundamentals first to have a strong foundation in learning web development. After mastering the fundamentals, you will learn the skills to use the tools for building websites and web applications.</p><h1>Practice building a lot of projects</h1><p>When learning fundamentals and specific tools, you will also practice implementing the knowledge you have gained by building your own projects. The scale of the projects ranges from tiny, small, medium, to large.</p><h1>Gain career skills</h1><p>Finally, after gaining the skills and practicing the projects, it is important to know how to sell yourself and your crafts to future employers, clients, or customers. These career skills are essential to prepare you to enter the professional web and software development industry.</p>"
      }
    ]
  },
  {
    "id": 3,
    "title": "Time duration to complete",
    "slug": "time-duration-to-complete",
    "level": "newbie",
    "type": "fundamental",
    "blocks": [
      {
        "component": "image",
        "name": "Hour glass",
        "src": "https://res.cloudinary.com/catamyst/image/upload/v1614161224/hour-glass.png",
        "width": "125px",
        "height": "150px",
        "sourceUrl": "https://catamyst.com"
      },
      {
        "component": "texts",
        "html": "<h1>Time expectation</h1><p>All of the activities are expected to be completed within 3 to 6 months, depending on your learning pace and effort. You can finish earlier in 2 months or longer in 1 year.</p><p>If you decide to spend at least 1 to 3 hours on weekdays and 5 to 8 hours on weekends, we can assume that you can finish them in 3 to 6 months. Of course, it would be more efficient if you spend more time per day.</p><h1>Faster is not always better</h1><p>To finish faster, some people might skip learning the knowledge and doing the projects directly. We do not recommend this way as each of them will give you the proper foundation to go to the next lessons. However, it is okay to skip some parts only if you already master them. Remember, the journey could take a while. Even after you have done them, you are still required to &quot;do the work&quot; because you need to always keep practicing.</p>"
      },
      {
        "component": "references",
        "items": [
          {
            "type": "video",
            "title": "Sal Khan: Let's teach for mastery -- not test scores",
            "source": "TED Talk",
            "url": "https://ted.com/talks/sal_khan_let_s_teach_for_mastery_not_test_scores"
          },
          {
            "type": "article",
            "title": "The 10,000 Hour Rule Is Wrong: How to Really Master a Skill",
            "source": "MakeUseOf",
            "author": "Rob Nightingale",
            "url": "https://makeuseof.com/tag/10000-hour-rule-wrong-really-master-skill"
          },
          {
            "type": "article",
            "title": "The Great Practice Myth: Debunking the 10,000 Hour Rule",
            "author": "Michael Miller",
            "source": "Six Seconds",
            "url": "https://6seconds.org/2018/02/09/the-great-practice-myth-debunking-the-10000-hour-rule-and-what-you-actually-need-to-know-about-practice"
          }
        ]
      }
    ]
  },
  {
    "id": 4,
    "title": "Device requirements",
    "slug": "device-requirements",
    "level": "newbie",
    "type": "specific",
    "blocks": [
      {
        "component": "texts",
        "html": "<p>Paragraph</p>"
      }
    ]
  },
  {
    "id": 5,
    "title": "Essential software tools",
    "slug": "essential-software-tools",
    "level": "newbie",
    "type": "specific",
    "blocks": [
      {
        "component": "texts",
        "html": "<p>Paragraph</p>"
      }
    ]
  },
  {
    "id": 6,
    "title": "Other software tools",
    "slug": "other-software-tools",
    "level": "newbie",
    "type": "specific",
    "blocks": [
      {
        "component": "texts",
        "html": "<p>Paragraph</p>"
      }
    ]
  },
  {
    "id": 7,
    "title": "Managing your tasks",
    "slug": "managing-your-tasks",
    "level": "newbie",
    "type": "project",
    "blocks": [
      {
        "component": "texts",
        "html": "<p>Paragraph</p>"
      }
    ]
  }
]
